configuration/src/InformationRegisters/ReportsDistributionHistory/ReportsDistributionHistory.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ReportsDistributionHistory</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Executed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>SessionNumber</name>
    <comment>Used for selecting the log based on the number of the report distribution session. For more information, see The number of the information database session in the syntax assistant.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OutgoingEmail</name>
    <type>
      <types>DocumentRef.OutgoingEmail</types>
    </type>
  </attributes>
  <attributes>
    <name>MethodOfObtaining</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.EmailMessagesStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DeliveryDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ReportMailing</name>
    <type>
      <types>CatalogRef.ReportMailings</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Recipient</name>
    <type>
      <types>DefinedType.BulkEmailRecipient</types>
    </type>
  </dimensions>
  <dimensions>
    <name>StartDistribution</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Account</name>
    <type>
      <types>CatalogRef.EmailAccounts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>EMAddress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ReportsDistributionHistory/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Private

// For internal use.
// 
Procedure CommitResultOfDistributionToRecipient(HistoryFields) Export
	SetPrivilegedMode(True);
	
	BeginTransaction();
	Try
		Block = New DataLock();
		LockItem = Block.Add("InformationRegister.ReportsDistributionHistory");
		LockItem.SetValue("ReportMailing", HistoryFields.ReportMailing);
		LockItem.SetValue("Recipient", HistoryFields.Recipient);
		LockItem.SetValue("StartDistribution", HistoryFields.StartDistribution);
		Block.Lock();
		
		RecordManager = CreateRecordManager();
		RecordManager.ReportMailing = HistoryFields.ReportMailing;
		RecordManager.Recipient      = HistoryFields.Recipient;
		RecordManager.StartDistribution  = HistoryFields.StartDistribution; 
		RecordManager.Account   = HistoryFields.Account;
		RecordManager.EMAddress         = HistoryFields.EMAddress;
		RecordManager.Period          = HistoryFields.Period;
		RecordManager.Read();
		
		RecordManager.Comment = ?(ValueIsFilled(RecordManager.Comment), RecordManager.Comment + Chars.LF
			+ HistoryFields.Comment, HistoryFields.Comment);
		FillPropertyValues(RecordManager, HistoryFields, , "Comment");

		RecordManager.Write(True);
		CommitTransaction();
	Except
		RollbackTransaction();
		Raise;
	EndTry;
EndProcedure

#EndRegion

#EndIf
